// Написати цикли, які зможуть:

// 1.Вивести на сторінку в один рядок через кому числа від 10 до 20.
// 2.Вивести квадрати чисел від 10 до 20.
// 3.Вивести таблицю множення на 7.
// 4.Знайти суму всіх цілих чисел від 1 до 15.
// 5.Знайти добуток усіх цілих чисел від 15 до 35.
// 6.Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
// 7.Вивести суму лише парних чисел в діапазоні від 30 до 80.
// 8.Вивести всі числа в діапазоні від 100 до 200 кратні 3.
// 9.Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
// 10.Визначити кількість його парних дільників.
// 11.Знайти суму його парних дільників.
// 12.Надрукувати повну таблицю множення від 1 до 10.

// __________________________________Task 1____________________________________
// 1.Вивести на сторінку в один рядок через кому числа від 10 до 20.

// let str = "";
// for (let i = 10; i <= 20; i++) {
//   str += `${i},`;
// }
// console.log(str);

// __or

// let str = "";
// for (let i = 10; i <= 20; i++) {
//   str += i;
//   if (i !== 20) {
//     str += ", ";
//   }
// }
// console.log(str);
// ----------------------------------------------------------------------------

// __________________________________Task 2____________________________________
// 2.Вивести квадрати чисел від 10 до 20.

// for (let i = 10; i <= 20; i++) {
//   let square = i * i;
//   console.log(`${i} ^ 2 = ${square}`);
// }
// ----------------------------------------------------------------------------

// __________________________________Task 3____________________________________
// 3.Вивести таблицю множення на 7.

// for (let i = 0; i <= 10; i++) {
//   console.log(`7 * ${i} = ${7 * i}`);
// }
// ----------------------------------------------------------------------------

// __________________________________Task 4____________________________________
// 4.Знайти суму всіх цілих чисел від 1 до 15.

// let sum = 0;

// for (let i = 1; i <= 15; i++) {
//   sum += i;
// }
// console.log("Сума всіх цілих чисел від 1 до 15 = " + sum);
// ----------------------------------------------------------------------------

// __________________________________Task 5____________________________________
// ----------------------------------------------------------------------------
